<h1>Read CSV File with empty start rows</h1>

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("./students.csv")

df

   SPRK Tech       Unnamed: 1 Unnamed: 2  Unnamed: 3
0     RollNo             Name     Gender  Percentage
1          1   Shivkumar Iyer       Male       65.55
2          2     Varun Sharma       Male       88.88
3          3      Rohit Gupta       Male        93.5
4          4    Monika Shinde     Female        98.9
5          5  Pranjal Gadhawe     Female       67.85
6          6   Ashutosh Gupta       Male       50.65
7          7       Dev Shirke       Male        32.5
8          8     Aditya Kumar       Male        88.6
9          9       Abdul Gani       Male        56.6
10        10    Saloni Mishra     Female       95.56

In [3]:
df = pd.read_csv("./students.csv", skiprows=1)
df

   RollNo             Name  Gender  Percentage
0       1   Shivkumar Iyer    Male       65.55
1       2     Varun Sharma    Male       88.88
2       3      Rohit Gupta    Male       93.50
3       4    Monika Shinde  Female       98.90
4       5  Pranjal Gadhawe  Female       67.85
5       6   Ashutosh Gupta    Male       50.65
6       7       Dev Shirke    Male       32.50
7       8     Aditya Kumar    Male       88.60
8       9       Abdul Gani    Male       56.60
9      10    Saloni Mishra  Female       95.56

In [8]:
df = pd.read_csv("./students.csv", header=1)
df

   RollNo             Name  Gender  Percentage
0       1   Shivkumar Iyer    Male       65.55
1       2     Varun Sharma    Male       88.88
2       3      Rohit Gupta    Male       93.50
3       4    Monika Shinde  Female       98.90
4       5  Pranjal Gadhawe  Female       67.85
5       6   Ashutosh Gupta    Male       50.65
6       7       Dev Shirke    Male       32.50
7       8     Aditya Kumar    Male       88.60
8       9       Abdul Gani    Male       56.60
9      10    Saloni Mishra  Female       95.56

In [10]:
df = pd.read_csv("./students.csv", header=1, names=["student_id","full_name","gender","percent"])
df

   student_id        full_name  gender  percent
0           1   Shivkumar Iyer    Male    65.55
1           2     Varun Sharma    Male    88.88
2           3      Rohit Gupta    Male    93.50
3           4    Monika Shinde  Female    98.90
4           5  Pranjal Gadhawe  Female    67.85
5           6   Ashutosh Gupta    Male    50.65
6           7       Dev Shirke    Male    32.50
7           8     Aditya Kumar    Male    88.60
8           9       Abdul Gani    Male    56.60
9          10    Saloni Mishra  Female    95.56

In [11]:
df = pd.read_csv("./students.csv", skiprows=1, nrows=4)
df

   RollNo            Name  Gender  Percentage
0       1  Shivkumar Iyer    Male       65.55
1       2    Varun Sharma    Male       88.88
2       3     Rohit Gupta    Male       93.50
3       4   Monika Shinde  Female       98.90